; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p8---int100n150-m25---int100c150---s77---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level9 level9)
(sum level0 level19 level19)
(sum level1 level1 level2)
(sum level1 level9 level10)
(sum level1 level19 level20)
(sum level2 level1 level3)
(sum level2 level9 level11)
(sum level2 level19 level21)
(sum level3 level1 level4)
(sum level3 level9 level12)
(sum level3 level19 level22)
(sum level4 level1 level5)
(sum level4 level9 level13)
(sum level4 level19 level23)
(sum level5 level1 level6)
(sum level5 level9 level14)
(sum level5 level19 level24)
(sum level6 level1 level7)
(sum level6 level9 level15)
(sum level6 level19 level25)
(sum level7 level1 level8)
(sum level7 level9 level16)
(sum level7 level19 level26)
(sum level8 level1 level9)
(sum level8 level9 level17)
(sum level8 level19 level27)
(sum level9 level1 level10)
(sum level9 level9 level18)
(sum level9 level19 level28)
(sum level10 level1 level11)
(sum level10 level9 level19)
(sum level10 level19 level29)
(sum level11 level1 level12)
(sum level11 level9 level20)
(sum level11 level19 level30)
(sum level12 level1 level13)
(sum level12 level9 level21)
(sum level13 level1 level14)
(sum level13 level9 level22)
(sum level14 level1 level15)
(sum level14 level9 level23)
(sum level15 level1 level16)
(sum level15 level9 level24)
(sum level16 level1 level17)
(sum level16 level9 level25)
(sum level17 level1 level18)
(sum level17 level9 level26)
(sum level18 level1 level19)
(sum level18 level9 level27)
(sum level19 level1 level20)
(sum level19 level9 level28)
(sum level20 level1 level21)
(sum level20 level9 level29)
(sum level21 level1 level22)
(sum level21 level9 level30)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)
(sum level25 level1 level26)
(sum level26 level1 level27)
(sum level27 level1 level28)
(sum level28 level1 level29)
(sum level29 level1 level30)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level19 l1 l2)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level19 l2 l1)

(at t0 l2)
(fuel t0 level30)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l2)
(at p3 l0)
(at p4 l2)
(at p5 l1)
(at p6 l2)
(at p7 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l2)
(at p4 l1)
(at p5 l0)
(at p6 l0)
(at p7 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 8
2. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 8
3. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 8
4. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 8
5. (drive t0 l2 l1 level11 level19 level30)
   deleted: (at t0 l2) (fuel t0 level30)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 0 of 8
6. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 1 of 8
7. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 8
8. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 2 of 8
9. (drive t0 l1 l0 level2 level9 level11)
   deleted: (at t0 l1) (fuel t0 level11)
   added: (at t0 l0) (fuel t0 level2)
   goals met: 2 of 8
10. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 3 of 8
11. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 3 of 8
12. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 3 of 8
13. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 3 of 8
14. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 4 of 8
15. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 5 of 8
16. (drive t0 l0 l2 level1 level1 level2)
   deleted: (at t0 l0) (fuel t0 level2)
   added: (at t0 l2) (fuel t0 level1)
   goals met: 5 of 8
17. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 6 of 8
18. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 7 of 8
19. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 8 of 8
